clackups/touch-gamepad/sdkconfig.defaults
# Shared build defaults for the touch-gamepad firmware.
# Applied before the board-specific overlay. ASCII only. See AGENTS.md.

CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash with a larger single-app partition for LVGL and Bluetooth.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Octal PSRAM holds the RGB panel framebuffers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# 1 kHz tick keeps touch polling and LVGL animations smooth.
CONFIG_FREERTOS_HZ=1000

# Bluetooth LE via Bluedroid for the BLE HID gamepad backend.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_CLASSIC_ENABLED=n

# The ESP32-S3 controller is BLE 5.0; the HID backend advertises through the
# extended advertising API, which requires the BLE 5.0 feature set.
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y

# LVGL color depth matches the RGB565 panel.
CONFIG_LV_COLOR_DEPTH_16=y

CONFIG_TOUCH_GAMEPAD_SCREEN_WIDTH=480
CONFIG_TOUCH_GAMEPAD_SCREEN_HEIGHT=480
CONFIG_TOUCH_GAMEPAD_CORNER_MARGIN=96
CONFIG_TOUCH_GAMEPAD_DEFAULT_THEME_BLUE=y